package HW8;

import org.w3c.dom.ls.LSOutput;

import static Utils.Utilss.*;

public class HW8_1 {

    //3. Создать объекты типа Integer, Double, String и присвоить им любые значения.
    public static Integer intObj = new Integer(5);
    static Double doubObj = 5.6;
    static String strObj = "String";

    public static void main(String[] args) {

       //3
        task();
        System.out.println(intObj);
        System.out.println(doubObj);
        System.out.println(strObj);

        //4 В классе HW8:
        //Импортировать статичные методы класса Utils, которые вы будете использовать во время выполнения HW8
        task();

        //5 Создать объекты типа Integer, Double, String и присвоить им такие же значения, как и переменным
        // класса HW8_1

    }



}
